Tekla.Structures.Drawing.ReferenceModel
The ReferenceModel class represents a reference model object in a drawing.

Tekla.Structures.Drawing.ReferenceModel.Attributes
Gets or sets the reference model object attributes.

Tekla.Structures.Drawing.ReferenceModel.#ctor
Create instance of ReferenceModel

Tekla.Structures.Drawing.ReferenceModel.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReferenceModel.Insert
Reference model objects cannot be inserted.
Returns: An exception.
Throws System.InvalidOperationException: Thrown always.

Tekla.Structures.Drawing.ReferenceModel.Select
Selects the reference model object.
Returns: True if succeeded.

Tekla.Structures.Drawing.ReferenceModel.Modify
Modifies the reference model object.
Returns: True if succeeded.

Tekla.Structures.Drawing.ReferenceModel.Delete
Reference model objects cannot be deleted.
Returns: An exception.
Throws System.InvalidOperationException: Thrown always.